### Zadanie 8: Łączenie ramek

To zadanie ma na celu pomoc w zrozumieniu, jak efektywnie łączyć dane z różnych źródeł i jakie są różnice pomiędzy różnymi typami łączeń.

Wyobraź sobie, że pracujesz w dziale sprzedaży firmy, która prowadzi różne kampanie marketingowe. Masz dwa pliki csv: jeden zawiera informacje o sprzedaży, a drugi o klientach. Twoim zadaniem będzie połączenie tych danych, aby uzyskać pełny obraz sprzedaży w kontekście klientów i kampanii.

**1. Wczytaj dane**

Wczytaj oba pliki CSV do osobnych ram danych.

In [3]:
import pandas as pd

In [5]:
# 1. Wczytaj dane
clients_df = pd.read_csv('data/clients.csv')
clients_df

   id_klienta                 nazwa    miasto
0           1         Anna Kowalska  Warszawa
1           2             Jan Nowak    Kraków
2           3  Katarzyna Wiśniewska    Gdańsk
3           6          Michał Zając   Wrocław

In [6]:
transactions_df = pd.read_csv('data/transactions.csv')
transactions_df

   id_klienta data_sprzedazy  sprzedaz
0           1     2023-01-15       300
1           2     2023-01-16       450
2           3     2023-01-17       200
3           4     2023-01-18       600
4           5     2023-01-19       350

**2. Sprzedaż z klientami, którzy dokonali zakupów**

Połącz ramki danych na podstawie id_klienta, aby uzyskać sprzedaż tylko tych klientów, którzy dokonali zakupów.

In [8]:
# 2. Sprzedaż z klientami, którzy dokonali zakupów
inner_merge = pd.merge(transactions_df, clients_df, on='id_klienta', how='inner')
print("Sprzedaż z klientami, którzy dokonali zakupów:")
inner_merge

Sprzedaż z klientami, którzy dokonali zakupów:

   id_klienta data_sprzedazy  sprzedaz                 nazwa    miasto
0           1     2023-01-15       300         Anna Kowalska  Warszawa
1           2     2023-01-16       450             Jan Nowak    Kraków
2           3     2023-01-17       200  Katarzyna Wiśniewska    Gdańsk

**3. Pełne dane o sprzedaży i klientach**

Połącz ramki danych, aby uzyskać wszystkie informacje o sprzedaży i klientach, wypełniając brakujące wartości NaN.

In [11]:
# 3. Pełne dane o sprzedaży i klientach
outer_merge = pd.merge(transactions_df, clients_df, on='id_klienta', how='outer')
print("\nPełne dane o sprzedaży i klientach:")
outer_merge

Pełne dane o sprzedaży i klientach:

   id_klienta data_sprzedazy  sprzedaz                 nazwa    miasto
0           1     2023-01-15     300.0         Anna Kowalska  Warszawa
1           2     2023-01-16     450.0             Jan Nowak    Kraków
2           3     2023-01-17     200.0  Katarzyna Wiśniewska    Gdańsk
3           4     2023-01-18     600.0                   NaN       NaN
4           5     2023-01-19     350.0                   NaN       NaN
5           6            NaN       NaN          Michał Zając   Wrocław

**4. Sprzedaż z wszystkich klientów**

Połącz ramki danych, aby uzyskać sprzedaż dla wszystkich klientów, nawet tych, którzy nie dokonali żadnych zakupów.

In [10]:
# 4. Sprzedaż z wszystkich klientów
left_merge = pd.merge(transactions_df, clients_df, on='id_klienta', how='left')
print("\nSprzedaż z wszystkich klientów:")
left_merge

Sprzedaż z wszystkich klientów:

   id_klienta data_sprzedazy  sprzedaz                 nazwa    miasto
0           1     2023-01-15       300         Anna Kowalska  Warszawa
1           2     2023-01-16       450             Jan Nowak    Kraków
2           3     2023-01-17       200  Katarzyna Wiśniewska    Gdańsk
3           4     2023-01-18       600                   NaN       NaN
4           5     2023-01-19       350                   NaN       NaN

**5. Klienci z zakupami**

Połącz ramki danych, aby uzyskać listę klientów, którzy dokonali zakupów oraz ich dane.

In [13]:
# 5. Klienci z zakupami
right_merge = pd.merge(transactions_df, clients_df, on='id_klienta', how='right')
print("\nKlienci z zakupami:")
right_merge

Klienci z zakupami:

   id_klienta data_sprzedazy  sprzedaz                 nazwa    miasto
0           1     2023-01-15     300.0         Anna Kowalska  Warszawa
1           2     2023-01-16     450.0             Jan Nowak    Kraków
2           3     2023-01-17     200.0  Katarzyna Wiśniewska    Gdańsk
3           6            NaN       NaN          Michał Zając   Wrocław

**6. Concat danych sprzedażowych**

Dodaj nowe dane sprzedażowe do istniejącej ramki z danymi sprzedaży:

<pre><code>additional_data = {
    'id_klienta': [7, 8],
    'data_sprzedazy': ['2023-01-20', '2023-01-21'],
    'sprzedaz': [500, 700]
}</code></pre>

In [14]:
# Dodatkowe dane sprzedażowe
additional_data = {
    'id_klienta': [7, 8],
    'data_sprzedazy': ['2023-01-20', '2023-01-21'],
    'sprzedaz': [500, 700]
}
additional_df = pd.DataFrame(additional_data)

In [15]:
# Concat sprzedaży
concat_result = pd.concat([transactions_df, additional_df], ignore_index=True)
print("\nConcat danych sprzedażowych:")
concat_result

Concat danych sprzedażowych:

   id_klienta data_sprzedazy  sprzedaz
0           1     2023-01-15       300
1           2     2023-01-16       450
2           3     2023-01-17       200
3           4     2023-01-18       600
4           5     2023-01-19       350
5           7     2023-01-20       500
6           8     2023-01-21       700